Revit 2026 API

# BuiltInFailuresStructuralLoadFailures Class

---

Failures about Load.

SystemObject Autodesk.Revit.DBBuiltInFailuresStructuralLoadFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class StructuralLoadFailures
```
```vb
Public NotInheritable Class StructuralLoadFailures
```
```cpp
public ref class StructuralLoadFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type StructuralLoadFailures = class end
```

The BuiltInFailuresStructuralLoadFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannotMirrorBoundaryCondition | Can't mirror Boundary Conditions |
|  | CannotMoveBoundaryCondition | Can't move Boundary Conditions |
|  | CannotPlaceBoundaryConditions | A boundary condition is already created on the selected element. Duplicate boundary conditions are not allowed. Click the Replace button to delete previous definition of boundary condition or cancel the operation. |
|  | HostChangeDisallowsLoadOrBoundaryConditions | Some Hosted Loads or BoundaryConditions lost their References. They will be deleted. |

#### Reference

Autodesk.Revit.DB Namespace